; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=8, locations=11, density=1.0, fully_connected=True, max_capacity=2, out_folder=./full/training, instance_id=52, seed=93

(define (problem transport-52)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l6)
    (at p2 l3)
    (at p3 l3)
    (at p4 l7)
    (at p5 l2)
    (at p6 l3)
    (at p7 l10)
    (at p8 l1)
    (at v1 l10)
    (at v2 l9)
    (at v3 l2)
    (at v4 l11)
    )
 (:goal  (and 
    (at p1 l10)
    (at p2 l6)
    (at p3 l7)
    (at p4 l2)
    (at p5 l11)
    (at p6 l2)
    (at p7 l11)
    (at p8 l4))))

; plan
1. (drive v4 l11 l1)
   deleted: (at v4 l11)
   added: (at v4 l1)
   goals met: 0 of 8
2. (pick-up v4 l1 p8 c0 c1)
   deleted: (at p8 l1) (capacity v4 c1)
   added: (in p8 v4) (capacity v4 c0)
   goals met: 0 of 8
3. (drive v4 l1 l4)
   deleted: (at v4 l1)
   added: (at v4 l4)
   goals met: 0 of 8
4. (drop v4 l4 p8 c0 c1)
   deleted: (in p8 v4) (capacity v4 c0)
   added: (at p8 l4) (capacity v4 c1)
   goals met: 1 of 8
5. (drive v2 l9 l3)
   deleted: (at v2 l9)
   added: (at v2 l3)
   goals met: 1 of 8
6. (pick-up v2 l3 p3 c1 c2)
   deleted: (at p3 l3) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 1 of 8
7. (pick-up v2 l3 p6 c0 c1)
   deleted: (at p6 l3) (capacity v2 c1)
   added: (in p6 v2) (capacity v2 c0)
   goals met: 1 of 8
8. (drive v2 l3 l7)
   deleted: (at v2 l3)
   added: (at v2 l7)
   goals met: 1 of 8
9. (drop v2 l7 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l7) (capacity v2 c1)
   goals met: 2 of 8
10. (pick-up v2 l7 p4 c0 c1)
   deleted: (at p4 l7) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 2 of 8
11. (drive v2 l7 l2)
   deleted: (at v2 l7)
   added: (at v2 l2)
   goals met: 2 of 8
12. (drop v2 l2 p4 c0 c1)
   deleted: (in p4 v2) (capacity v2 c0)
   added: (at p4 l2) (capacity v2 c1)
   goals met: 3 of 8
13. (pick-up v2 l2 p5 c0 c1)
   deleted: (at p5 l2) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 3 of 8
14. (drop v2 l2 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l2) (capacity v2 c1)
   goals met: 4 of 8
15. (drive v2 l2 l3)
   deleted: (at v2 l2)
   added: (at v2 l3)
   goals met: 4 of 8
16. (pick-up v2 l3 p2 c0 c1)
   deleted: (at p2 l3) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 4 of 8
17. (drive v2 l3 l6)
   deleted: (at v2 l3)
   added: (at v2 l6)
   goals met: 4 of 8
18. (drop v2 l6 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l6) (capacity v2 c1)
   goals met: 5 of 8
19. (pick-up v2 l6 p1 c0 c1)
   deleted: (at p1 l6) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 5 of 8
20. (drive v2 l6 l10)
   deleted: (at v2 l6)
   added: (at v2 l10)
   goals met: 5 of 8
21. (drop v2 l10 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l10) (capacity v2 c1)
   goals met: 6 of 8
22. (pick-up v2 l10 p7 c0 c1)
   deleted: (at p7 l10) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 6 of 8
23. (drive v2 l10 l11)
   deleted: (at v2 l10)
   added: (at v2 l11)
   goals met: 6 of 8
24. (drop v2 l11 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l11) (capacity v2 c1)
   goals met: 7 of 8
25. (drop v2 l11 p7 c1 c2)
   deleted: (in p7 v2) (capacity v2 c1)
   added: (at p7 l11) (capacity v2 c2)
   goals met: 8 of 8
